export const DB_URL = 'https://imageup.ru';

export const beatfilmMovies = [
  {
    id: 1,
    nameRU: '33 слова о дизайне',
    duration: 77,
    description:
      'Школа дизайна Bang Bang Education собрала компанию из 33 современных русских дизайнеров. Все они говорят и думают по-русски и неизбежно вдохновляются тем, что вошло в наш быт, книги, практики, ритуалы, праздники, экономику, историческую память и моду. Этот альманах — поиск особенностей и границ национального восприятия красоты, желание увидеть, какие этические и эстетические ценности мы несем миру.',
    trailerLink: 'https://www.kinopoisk.ru/film/1302273/video/',
    image: {
      url: '/img287/4523280/poster-1.jpg',
    },
  },
  {
    id: 2,
    nameRU: 'Киноальманах «100 лет дизайна»',
    duration: 77,
    description:
      'Просветительский проект и документальный фильм, о том, как современная визуальная культура вышла из 1918 года. Цель альманаха — дать системное представление о том, какой путь проделал дизайн от школы Баухаус до 2018 года.',
    trailerLink: 'https://www.kinopoisk.ru/film/1118071/video/148987/',
    image: {
      url: '/img113/4523287/poster-2.jpg',
    },
  },
  {
    id: 3,
    nameRU: 'В погоне за Бенкси',
    duration: 77,
    description:
      'Попытка разгадать тайну главного уличного художника планеты. Авторы ищут ответ на вопрос, что за человек скрывается за псевдонимом Бенкси: они хотят и найти Кларка Кента за маской Супермена, и одновременно провести исследование его мифа.',
    trailerLink: 'https://www.kinopoisk.ru/film/1390163/video/168351/',
    image: {
      url: '/img137/4523290/poster-3.jpg',
    },
  },
  {
    id: 4,
    nameRU: 'Баския: Взрыв реальности',
    duration: 77,
    description:
      'История художника Жана-Мишеля Баския от первых шагов в искусстве до момента продажи своей первой картины. Портрет художника в юности — заразительный жанр документалистики, особенно когда место становления — Нью-Йорк рубежа 70-х и 80-х на пороге катастрофы. В разоренном городе, где пустые дома поджигали для сбора страховых денег, гаитянский парень в свободном пальто и выбритым лбом выглядел как ещё один полубездомный художник, с которым не случится ничего хорошего.',
    trailerLink: 'https://www.kinopoisk.ru/film/1081536/video/148768/',
    image: {
      url: '/img123/4523291/poster-4.jpg',
    },
  },
  {
    id: 5,
    nameRU: 'Бег это свобода',
    duration: 77,
    description:
      'Об этом сегодня мало кто помнит, но 50 лет назад простым бегунам приходилось быть бунтарями — места в этом спорте официально не было ни женщинам, ни любителям. Все, разумеется, изменили 60-е годы, время борьбы за права на всех фронтах. Начиная именно с них, «Free to run» рассказывает историю бега как историю огромного общественного движения — от романтических провокаций до создания огромной индустрии.',
    trailerLink: 'https://www.kinopoisk.ru/film/895595/video/132953/',
    image: {
      url: '/img234/4523292/poster-5.jpg',
    },
  },
  {
    id: 6,
    nameRU: 'Книготорговцы',
    duration: 77,
    description:
      'Путешествие в мир нью-йоркских букинистов и коллекционеров книжных сокровищ, которые, пожалуй, отличаются от российских коллег вековыми фамильными традициями и большим видовым разнообразием. Но гораздо важнее общие черты: это не просто представители «бизнес-сообщества», это энтузиасты, знатоки, а иногда и эксцентрики, объединенные невероятным увлечением.',
    trailerLink: 'https://www.kinopoisk.ru/film/1347315/video/165881/',
    image: {
      url: '/img281/4523293/poster-6.jpg',
    },
  },
  {
    id: 7,
    nameRU: 'Когда я думаю о Германии ночью',
    duration: 77,
    description:
      'Фильм-концерт по случаю 25-летия техно-сцены, состоящий из пространных рассуждений пятерых заслуженных (иначе правда не скажешь) диджеев и музыкантов. Почему Германия? Каково это — играть в Париже ночью после атаки на редакцию Charlie Hebdo? Почему именно техно создает резонанс, который объединяет таких независимых и немного несчастных в своем одиночестве европейцев?',
    trailerLink: 'https://www.kinopoisk.ru/film/1044733/video/140470/',
    image: {
      url: '/img13/4523294/poster-7.jpg',
    },
  },
  {
    id: 8,
    nameRU: 'Gimme Danger: История Игги и The Stooges',
    duration: 77,
    description:
      'История группы The Stooges, одной из величайших рок-н-ролл групп всех времен. Появившись в Анн-Арбор (Мичиган) в эпоху контркультурной революции, яркий и агрессивный рок-н-ролл The Stooges перевернул музыкальный мир конца 60-х. Обрушив на аудиторию замес рока, блюза, R&B и джаза, группа дала начало тому, что впоследствии назовут панком и альтернативным роком.',
    trailerLink: 'https://www.kinopoisk.ru/film/565818/video/135943/',
    image: {
      url: '/img7/4523295/poster-8.jpg',
    },
  },
  {
    id: 9,
    nameRU: 'Дженис: Маленькая девочка грустит',
    duration: 77,
    description:
      'В фильме певица Кет Пауэр рассказывает о звездном пути Дженис Джоплин, обращаясь к письмам, которые Джоплин в разные годы писала друзьям, родственникам и коллегам.',
    trailerLink: 'https://www.kinopoisk.ru/film/868643/video/126761/',
    image: {
      url: '/img172/4523296/poster-9.jpg',
    },
  },
  {
    id: 10,
    nameRU: 'Соберись перед прыжком',
    duration: 77,
    description:
      'О жизни и дружбе трёх молодых парней, выросших в Рокфорде, штат Иллинойс, объединенных любовью к скейтбордингу.',
    trailerLink: 'https://www.kinopoisk.ru/film/1112205/video/',
    image: {
      url: '/img148/4523298/poster-10.jpg',
    },
  },
  {
    id: 11,
    nameRU: 'Пи Джей Харви: A dog called money',
    duration: 77,
    description:
      'Фильм о певице Пи Джей Харви, снятый близким другом певицы, ирландским фотографом и военным корреспондентом Шеймусом Мерфи. Их первой совместной работой была серия короткометражек к каждой песне ее альбома Let England Shake (2011).',
    trailerLink: 'https://www.kinopoisk.ru/film/1249517/video/160283/',
    image: {
      url: '/img100/4523299/poster-11.jpg',
    },
  },
  {
    id: 12,
    nameRU: 'По волнам: Искусство звука в кино',
    duration: 77,
    description:
      'Рассказ о появлении и развитии звукового кино, о вкладе голливудских звукорежиссеров в изменение подхода к созданию аудиоряда в кинематографе.',
    trailerLink: 'https://youtu.be/WsIE4x3xU0Y?si=snuJQrDrDft3MJp5',
    image: {
      url: '/img172/4523300/poster-12.jpg',
    },
  },
];

export const savedMovies = [
  {
    id: 1,
    nameRU: '33 слова о дизайне',
    duration: 77,
    description:
      'Школа дизайна Bang Bang Education собрала компанию из 33 современных русских дизайнеров. Все они говорят и думают по-русски и неизбежно вдохновляются тем, что вошло в наш быт, книги, практики, ритуалы, праздники, экономику, историческую память и моду. Этот альманах — поиск особенностей и границ национального восприятия красоты, желание увидеть, какие этические и эстетические ценности мы несем миру.',
    trailerLink: 'https://www.kinopoisk.ru/film/1302273/video/',
    image: {
      url: '/img287/4523280/poster-1.jpg',
    },
  },
  {
    id: 2,
    nameRU: 'Киноальманах «100 лет дизайна»',
    duration: 77,
    description:
      'Просветительский проект и документальный фильм, о том, как современная визуальная культура вышла из 1918 года. Цель альманаха — дать системное представление о том, какой путь проделал дизайн от школы Баухаус до 2018 года.',
    trailerLink: 'https://www.kinopoisk.ru/film/1118071/video/148987/',
    image: {
      url: '/img113/4523287/poster-2.jpg',
    },
  },
  {
    id: 3,
    nameRU: 'В погоне за Бенкси',
    duration: 77,
    description:
      'Попытка разгадать тайну главного уличного художника планеты. Авторы ищут ответ на вопрос, что за человек скрывается за псевдонимом Бенкси: они хотят и найти Кларка Кента за маской Супермена, и одновременно провести исследование его мифа.',
    trailerLink: 'https://www.kinopoisk.ru/film/1390163/video/168351/',
    image: {
      url: '/img137/4523290/poster-3.jpg',
    },
  },
];
